In [1]:
import numpy as np
import pandas as pd

In [2]:
#pandas operations
#conditional selection
#Access rows & col's
#Add & delete columns
#concatenation merging & joining dataframes
#handling missing values
#apply()

In [15]:
d={'USN':[100,101,102],
   'Name':['jerry','tom','ramesh'],
   'Mobile':[99,88,77],
   'marks':[30,35,None,]
}

In [16]:
std=pd.DataFrame(d)

In [17]:
std

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [18]:
#datafame operations
std.head(2)
#head- displaying rows
#display all by default
#parameter passed, display rows as per parameter

   USN   Name  Mobile  marks
0  100  jerry      99   30.0
1  101    tom      88   35.0

In [19]:
std.columns
#list of columns in my df

Index(['USN', 'Name', 'Mobile', 'marks'], dtype='object')

In [20]:
std.info()
#give all the information about df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
 3   marks   2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [21]:
std.isnull()

     USN   Name  Mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False   True

In [10]:
std

   USN    Name  Mobile marks
0  100   jerry      99    30
1  101     tom      88    35
2  102  ramesh      77   nan

In [11]:
#access columns
std['USN']

0    100
1    101
2    102
Name: USN, dtype: int64

In [12]:
#access multiple columns
std[['USN','marks']]

   USN marks
0  100    30
1  101    35
2  102   nan

In [13]:
std

   USN    Name  Mobile marks
0  100   jerry      99    30
1  101     tom      88    35
2  102  ramesh      77   nan

In [23]:
#access rows
std.loc[1]
#returns row

USN        101
Name       tom
Mobile      88
marks     35.0
Name: 1, dtype: object

In [24]:
std.iloc[2]

USN          102
Name      ramesh
Mobile        77
marks        NaN
Name: 2, dtype: object

In [26]:
index=['A','B','C']
std.set_index('USN')

       Name  Mobile  marks
USN
100   jerry      99   30.0
101     tom      88   35.0
102  ramesh      77    NaN

In [27]:
std.iloc[2]

USN          102
Name      ramesh
Mobile        77
marks        NaN
Name: 2, dtype: object

In [41]:
std

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [44]:
#conditional selection
newdf=std['marks']>=30

In [45]:
std[newdf]['Name']

0    jerry
1      tom
Name: Name, dtype: object

In [48]:
#multiple conditions
std[(std['Name']=='jerry')
    &(std['marks']>20)]

   USN   Name  Mobile  marks
0  100  jerry      99   30.0

In [50]:
std[(std['USN']>100) & (std['marks']<40)]

   USN Name  Mobile  marks
1  101  tom      88   35.0

In [51]:
#adding new column
s='banglore,delhi,kashmir'.split(',')
print(s,type(s))

['banglore', 'delhi', 'kashmir'] <class 'list'>

In [53]:
std['Address']=s

In [54]:
std

   USN    Name  Mobile  marks   Address
0  100   jerry      99   30.0  banglore
1  101     tom      88   35.0     delhi
2  102  ramesh      77    NaN   kashmir

In [58]:
std.drop('Address',axis=1,inplace=True)

In [59]:
std

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     tom      88   35.0
2  102  ramesh      77    NaN

In [61]:
std.drop(2)

   USN   Name  Mobile  marks
0  100  jerry      99   30.0
1  101    tom      88   35.0

In [62]:
d2={'USN':[100,101,102],
   'Name':['jerry','nan','ramesh'],
   'Mobile':[99,88,77],
   'marks':[30,35,None,]
}

In [63]:
df=pd.DataFrame(d2)

In [64]:
df

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     nan      88   35.0
2  102  ramesh      77    NaN

In [65]:
df.dropna()

   USN   Name  Mobile  marks
0  100  jerry      99   30.0
1  101    nan      88   35.0

In [77]:
d2={'USN':[None,None,102],
   'Name':[None,None,'ramesh'],
   'Mobile':[99,88,77],
   'marks':[30,35,None,]
}

In [78]:
df=pd.DataFrame(d2)

In [79]:
df

     USN    Name  Mobile  marks
0    NaN    None      99   30.0
1    NaN    None      88   35.0
2  102.0  ramesh      77    NaN

In [81]:
df.dropna(thresh=2)

     USN    Name  Mobile  marks
0    NaN    None      99   30.0
1    NaN    None      88   35.0
2  102.0  ramesh      77    NaN